class BusSchedule {
  final int id;
  final String title;
  final List<Map<String, String>> times;
  final List<String> trip;

  BusSchedule(this.id, this.title, this.trip, this.times);

}

List<BusSchedule> schedules = [
  BusSchedule(0, "1", [
    "Больничный городок - ОАО \"Нафтан\"",
    "ОАО \"Нафтан\" - Больничный городок",
  ], [
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },


  ])
];