class BusSchedule {
  final int id;
  final String title;
  final List<Map<String, String>> times;
  final List<String> trip;

  BusSchedule(this.id, this.title, this.trip, this.times);

}

class DatePicker {
  final int id;
  final String title;

  DatePicker(this.id, this.title);
}

List<DatePicker> daysOnWeek = [
  DatePicker(0, "Пн",),
  DatePicker(1, "Вт"),
  DatePicker(2, "Ср"),
  DatePicker(3, "Чт"),
  DatePicker(4, "Пт"),
  DatePicker(5, "Сб"),
  DatePicker(6, "Вс")
];


List<BusSchedule> schedules = [
  BusSchedule(0, "1", [
    "Больничный городок - ОАО \"Нафтан\"",
    "ОАО \"Нафтан\" - Больничный городок",
  ], [
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },


  ]),
  BusSchedule(1, "2a", [
    "Больничный городок - ОАО \"Нафтан\"",
    "ОАО \"Нафтан\" - Больничный городок",
  ], [
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },


  ]),
  BusSchedule(2, "3", [
    "Больничный городок - ОАО \"Нафтан\"",
    "ОАО \"Нафтан\" - Больничный городок",
  ], [
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },


  ]),
  BusSchedule(3, "4", [
    "Больничный городок - ОАО \"Нафтан\"",
    "ОАО \"Нафтан\" - Больничный городок",
  ], [
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },
    {
      "titles": "м-н\"Березка\"|Золотая нива|1-я палатка|Гайдара|Слободская|Техникум|Трамвайный парк|Подстанция|БСМ|Автопарк|НЗМ|ОАО \"Нафтан\"|ТЭЦ|СУ-ТЭЦ|АВТ",
      "times": "7:20 |	7:21 |	7:22 |	7:24 |	7:26 |	7:28 |	7:30 |	7:32 |	7:34 |	7:35	| 7:36 |	7:39 |	7:45 |	7:47 |	7:49",
    },


  ])
];